Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: To confirm it, enter `/hello` as the `Service Address` in the `Test Service` area and press `With Access Token` and you will get the HTTP `401` status:
ja_jp: 確認するには、 `Test Service` 領域の `Service Address` として `/hello` を入力して `With Access Token` を押すと、HTTP `401` ステータスが表示されます。

source: To confirm that it really does work, update the test endpoint to allow a `user` role only with `@RolesAllowed("user")`. Try to access the endpoint from OIDC Dev UI again, and you will get the HTTP `403` error. Revert the code back to `@RolesAllowed("admin")` to get the reassuring HTTP `200` status again.
ja_jp: 実際に動作することを確認するには、 `@RolesAllowed("user")` でのみ `user` ロールを許可するようにテストエンドポイントを更新します。その後、OIDC Dev UI からエンドポイントに再度アクセスすると、HTTP `403` エラーが発生します。コードを `@RolesAllowed ("admin")` に戻すと、HTTP `200` ステータスが再び表示されます。

source: To confirm the permission is correctly enforced, change it to `echo.name`: `@PermissionsAllowed("echo.name")`. Clear the browser cache, access http://localhost:8080/hello again and you will get `403` reported by `ApiEchoService`. Now revert it back to `@PermissionsAllowed("echo:name")`.
ja_jp: 権限が正しく適用されていることを確認するには、これを `echo.name`: `@PermissionsAllowed("echo.name")` に変更します。ブラウザーのキャッシュをクリアし、 http://localhost:8080/hello に再度アクセスすると、 `ApiEchoService` によって `403` が報告されます。ここで、権限を `@PermissionsAllowed ("echo:name")` に戻します。

source: To connect to Azure Event Hub, using the Kafka protocol with TLS, you need the following configuration:
ja_jp: TLS で Kafka プロトコルを使用して Azure Event Hub に接続するには、以下の設定が必要です。

source: To connect to redis cloud, you need the following properties:
ja_jp: redis クラウドに接続するためには、以下のプロパティーが必要です。

source: To consider only de-facto standard header (`Forwarded` header), please include the following lines in `src/main/resources/application.properties`:
ja_jp: デファクトスタンダードのヘッダー ( `Forwarded` header ) だけを考慮するためには、 `src/main/resources/application.properties` に以下の行を記述してください。

source: To consider only non-standard headers, please include the following lines instead in `src/main/resources/application.properties`:
ja_jp: 非標準のヘッダーのみを考慮するには、代わりに以下の行を `src/main/resources/application.properties` に記述してください。

source: To constrain this behavior to the standard `Forwarded` header (and ignore `X-Forwarded` variants) by setting `quarkus.management.proxy.allow-forwarded` in `src/main/resources/application.properties`:
ja_jp: `quarkus.management.proxy.allow-forwarded` を `src/main/resources/application.properties` で設定することで、この動作を標準の `Forwarded` ヘッダーに限定する (`X-Forwarded` のバリアントを無視する) ことができます。

source: To consume `Fruit` instances stored on a Kafka topic, and persist them into a database, you can use the following approach:
ja_jp: Kafka トピックに保存されている `Fruit` インスタンスを消費し、それらをデータベースに永続化するには、次のアプローチを使用できます。

source: To consume events, use the `io.quarkus.vertx.ConsumeEvent` annotation:
ja_jp: イベントを消費するには、 `io.quarkus.vertx.ConsumeEvent` アノテーションを使用します。

source: To containerize your Quarkus application that use `@RunOnVirtualThread`, add the following properties in your `application.properties`:
ja_jp: `@RunOnVirtualThread` を使用する Quarkus アプリケーションをコンテナー化するには、 `application.properties` に以下のプロパティーを追加します。

source: To control the RESTassured base path (i.e. the default path that serves as the root for every request) you can use the `io.quarkus.test.common.http.TestHTTPEndpoint` annotation. This can be applied at the class or method level. To test out greeting resource we would do:
ja_jp: RESTassured ベースパス (すなわち、すべてのリクエストのルートとなるデフォルトパス) を制御するには、 `io.quarkus.test.common.http.TestHTTPEndpoint` アノテーションを使用できます。これはクラスやメソッドレベルで適用できます。 グリーティングリソースをテストするには、以下のようにします:

source: To control the https://kubernetes.io/docs/concepts/services-networking/service/#nodeport[nodePort] that is used in this case, users can set `quarkus.kubernetes.node-port`. Note however that this configuration is entirely optional because Quarkus will automatically use a proper (and non-changing) value if none is set.
ja_jp: この場合に使用される https://kubernetes.io/docs/concepts/services-networking/service/#nodeport[nodePort] を制御するために、ユーザーは `quarkus.kubernetes.node-port` を設定することができます。 しかし、何も設定されていない場合、Quarkusは自動的に適切な（変更されない）値を使用するため、この設定は完全に任意であることに注意してください。

source: To control the logger name, choose one of the following injection patterns:
ja_jp: ロガー名を制御するには、以下の注入パターンのいずれかを選択してください。

source: To correctly lookup `Map` properties where `FOO_BAR_BAZ` is the property name and `BAR_BAZ` is the key, add `foo.bar-baz` in a source with an ordinal lower than the EnvConfigSource (`300`).
ja_jp: `FOO_BAR_BAZ` がプロパティ名、 `BAR_BAZ` がキーである `Map` プロパティを正しく検索するには、EnvConfigSource（ `300` ）より若い序列を持つソースに `foo.bar-baz` を追加します。

source: To create a Dev Service, add a new build step into the extension processor class that returns a `DevServicesResultBuildItem`. Here, the https://hub.docker.com/_/hello-world[`hello-world`] image is used, but you should set up the right image for your service.
ja_jp: Dev Service を作成するには、 `DevServicesResultBuildItem` を返す新しいビルドステップをエクステンションプロセッサークラスに追加します。 ここでは、 https://hub.docker.com/_/hello-world[`hello-world`] イメージが使用されていますが、サービスに適切なイメージをセットアップする必要があります。

source: To create a Gradle project, add the `--gradle` or `--gradle-kotlin-dsl` option.
ja_jp: Gradleプロジェクトを作成するには、 `--gradle` または `--gradle-kotlin-dsl` オプションを追加します。

source: To create a Gradle project, add the `-DbuildTool=gradle` or `-DbuildTool=gradle-kotlin-dsl` option.
ja_jp: Gradleプロジェクトを作成するには、 `-DbuildTool=gradle` または `-DbuildTool=gradle-kotlin-dsl` オプションを追加します。

source: To create a fruit using the reactive REST endpoint:
ja_jp: リアクティブ REST エンドポイントを使用して fruit を作成するには以下を実行します。

source: To create a fruit:
ja_jp: fruit を作成するには以下を実行します。

source: To create a lambda container image that uses the native executable we'll need to do things a little differently. In this case, we won't need to use the `java:11` base image from AWS, but instead we'll use a special image that assumes that the runtime environment for the lambda is provided. The example below creates such a container. It assumes that a Maven build has been executed (such as `mvn package -Dnative=true`) and has generated the native binary into the `target/` directory. The binary needs to be named `bootstrap` and be placed in `/var/runtime/`:
ja_jp: ネイティブ実行可能ファイルを使用するラムダコンテナイメージを作成するには、少し異なる方法を用いる必要があります。この場合、AWS の `java:11` ベースイメージを使用する必要はなく、代わりにラムダの実行環境が提供されていることを前提とした特別なイメージを使うことになります。以下の例では、そのようなコンテナを作成しています。Maven のビルドが実行され (`mvn package -Dnative=true` など)、ネイティブバイナリーが `target/` ディレクトリーに生成されたと仮定しています。バイナリーは `bootstrap` という名前で、 `/var/runtime/` に配置する必要があります。

source: To create a new Maven project with the Jakarta Persistence extension, complete one of the following steps:
ja_jp: Jakarta Persistence エクステンションで新しい Maven プロジェクトを作成するには、以下のいずれかの手順を実行します。

source: To create a new Maven project, use the following command:
ja_jp: 新しい Maven プロジェクトを作成するには、次のコマンドを使用します。

source: To create a new extension with a Codestart skeleton provide the `--codestart` flag to the `create extension` command:
ja_jp: Codestartのスケルトンで新しいエクステンションを作成するには、 `create extension` コマンドに `--codestart` フラグを指定します。

source: To create a new project we use the `create` command (the `app` subcommand is implied when not specified):
ja_jp: 新しいプロジェクトを作成するには、 `create` コマンドを使用します (指定されていない場合は、 `app` サブコマンドが暗黙的に指定されます)。

source: To create a new project, use the `create` command (the `app` subcommand is implied when not specified):
ja_jp: 新しいプロジェクトを作成するには、 `create` コマンドを使用します（ `app` サブコマンドは、指定しない場合は暗黙で適用されます）:

source: To create a new project:
ja_jp: 新しいMavenプロジェクトを作成するには:

source: To create a new realm, import the link:{quickstarts-tree-url}/security-keycloak-authorization-quickstart/config/quarkus-realm.json[realm configuration file]. For detailed steps on creating realms, refer to the Keycloak documentation: https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[Create a new realm].
ja_jp: 新しいレルムを作成するには、link:{quickstarts-tree-url}/security-keycloak-authorization-quickstart/config/quarkus-realm.json[レルム設定ファイル] をインポートします。 レルムを作成する詳細な手順については、Keycloak のドキュメント ( https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[新しいレルムを作成する]) を参照してください。

source: To create a new realm, import the link:{quickstarts-tree-url}/security-openid-connect-web-authentication-quickstart/config/quarkus-realm.json[realm configuration file]. For more information, see the Keycloak documentation about how to https://www.keycloak.org/docs/latest/server_admin/index.html#configuring-realms[create and configure a new realm].
ja_jp: 新しいレルムを作成するには、 link:{quickstarts-tree-url}/security-openid-connect-web-authentication-quickstart/config/quarkus-realm.json[レルム設定ファイル] をインポートします。 link:https://www.keycloak.org/docs/latest/server_admin/index.html#configuring-realms[新しいrealmを作成して設定] する方法について詳しくはKeycloakのドキュメントを参照してください。

source: To create an ID for a new file or a section to which you want to refer, insert the anchor ID as follows:
ja_jp: 参照する新しいファイルまたはセクションの ID を作成するには、次のようにアンカー ID を挿入します。

source: To create an anchor with a custom URL caption example, specify the anchored ID and desired name separated by `,` without white space.
ja_jp: カスタムURLキャプションの例でアンカーを作成するには、アンカーIDと希望する名前を空白なしで `,` で区切って指定します。

source: To create an anchored ID, use lower-case characters, separate each word with `-`, and enclose the ID in `[[]]` as in the example below.
ja_jp: アンカーIDを作成するには、小文字を使用し、各単語を `-` で区切り、以下の例のように `[[]]` でIDを囲んでください。

source: To create configurations for multiple tenants while avoiding excessive entries in your configuration file, you can use the `io.quarkus.keycloak.pep.TenantPolicyConfigResolver` interface to define them programmatically at runtime.
ja_jp: 設定ファイル内の過剰なエントリーを避けながら複数のテナントの設定を作成するには、 `io.quarkus.keycloak.pep.TenantPolicyConfigResolver` インターフェイスを使用して、実行時にプログラムで定義することができます。

source: To create the Maven project with Hibernate ORM, use the following command:
ja_jp: Hibernate ORM を使用して Maven プロジェクトを作成するには、次のコマンドを使用します。

source: To create the Maven project, use the following command:
ja_jp: まず、新しいプロジェクトが必要です。以下のコマンドで新規プロジェクトを作成します:

source: To create the _processor_ project, from the same directory, run:
ja_jp: _processor_ プロジェクトを作成するには、同じディレクトリから、次のように実行します:

source: To create the _producer_ project, in a terminal run:
ja_jp: _producer_ プロジェクトを作成するには、ターミナルで次のように実行します:

source: To customise the propagation header you can implement the `TextMapPropagatorCustomizer` interface. This can be used, as an example, to restrict propagation of OpenTelemetry trace headers and prevent potentially sensitive data to be sent to third party systems.
ja_jp: 伝播ヘッダーをカスタマイズするには、 `TextMapPropagatorCustomizer` インターフェイスを実装します。たとえば、これを使用して、OpenTelemetry トレースヘッダーの伝播を制限し、機密性の高いデータがサードパーティーのシステムに送信されないようにすることができます。

source: To customize Flyway for the default datasource, simply add a bean like so:
ja_jp: Flywayをデフォルトのデータソース用にカスタマイズするには、次のようなBeanを追加するだけです:

source: To customize the JAXB configuration for either the JAXB context, and/or the Marshaller/Unmarshaller components, the suggested approach is to define a CDI bean of type `io.quarkus.jaxb.runtime.JaxbContextCustomizer`.
ja_jp: JAXB コンテキスト、および/または Marshaller/Unmarshaller コンポーネントの JAXB 設定をカスタマイズするには、タイプ `io.quarkus.jaxb.runtime.JaxbContextCustomizer` の CDI Bean を定義することをお勧めします。

source: To customize the client ID and secret, you can use the `quarkus.oidc.client-id` and `quarkus.oidc.credentials.secret` properties.
ja_jp: クライアント ID とシークレットをカスタマイズするには、`quarkus.oidc.client-id` プロパティーと `quarkus.oidc.credentials.secret` プロパティーを使用できます。

source: To customize the default `host` and `path` properties of the generated Ingress resources, you need to apply the following configuration:
ja_jp: 生成されたIngressリソースのデフォルトの `host` 、 `path` プロパティーをカスタマイズするには、次の設定を適用する必要があります:

source: To customize the signature algorithm, use the `JwtSignatureBuilder` API. For example:
ja_jp: 署名アルゴリズムをカスタマイズするには、 `JwtSignatureBuilder` API を使用します。例:

source: To deactivate Hibernate Search in a given persistence unit at runtime, set `quarkus.hibernate-search-orm-elasticsearch[.optional name].active` to `false`. This works similarly to xref:hibernate-orm.adoc#persistence-unit-active[the corresponding feature of the Hibernate ORM extension], but for <<injecting-entry-points,Hibernate Search beans>>.
ja_jp: 実行時に特定の永続化ユニットで Hibernate Search を非アクティブ化するには、`quarkus.hibernate-search-orm-elasticsearch[.optional name].active` を `false` に設定します。これは xref:hibernate-orm.adoc#persistence-unit-active[Hibernate ORM エクステンションの対応する機能] と同様に機能しますが、<<injecting-entry-points,Hibernate Search Bean>> に適用されます。

source: To deactivate a Mongo Client at runtime, either:
ja_jp: 実行時に Mongo クライアントを非アクティブ化するには、次のいずれかを実行します。

source: To deactivate a Redis Client at runtime, either:
ja_jp: 実行時に Redis クライアントを無効にするには、以下のいずれかを行います。

source: To deactivate a datasource at runtime, either:
ja_jp: ランタイムにデータソースを非アクティブ化するには、次のいずれかを実行します。

source: To deactivate a datasource at runtime, set `quarkus.datasource[.optional name].active` to `false`. Then Quarkus will not start the corresponding JDBC connection pool or reactive client on application startup. Any attempt to use the corresponding datasource at runtime will fail with a clear error message.
ja_jp: 実行時にデータソースを非アクティブにするには、 `quarkus.datasource[.optional name].active` を `false` に設定します。 その場合、Quarkusはアプリケーション起動時に対応するJDBC接続プールまたはリアクティブクライアントを起動しません。 実行時に対応するデータソースを使用しようとすると、明確なエラーメッセージとともに失敗します。

source: To deactivate a persistence unit at runtime, see xref:hibernate-orm.adoc#persistence-unit-active[the corresponding section of the Hibernate ORM guide].
ja_jp: 実行時に永続化ユニットを非アクティブ化するには、xref:hibernate-orm.adoc#persistence-unit-active[Hibernate ORM ガイドの該当セクション] を参照してください。

source: To deactivate a persistence unit at runtime, set `quarkus.hibernate-orm[.optional name].active` to `false`.
ja_jp: 実行時に永続化ユニットを非アクティブ化するには、 `quarkus.hibernate-orm[.optional name].active` を `false` に設定します。

source: To deactivate a persistence unit at runtime, set `quarkus.hibernate-orm[.optional name].active` to `false`. If a persistence unit is not active:
ja_jp: 実行時に永続化ユニットを非アクティブ化するには、 `quarkus.hibernate-orm[.optional name].active` を `false` に設定します。 永続化ユニットがアクティブでない場合は、以下のようになります。

source: To debug the application you use `jbang --debug quarkusapp.java` and you can use your IDE to connect on port 4004; if you want to use the more traditional Quarkus debug port you can use `jbang --debug=5005 quarkusapp.java`.
ja_jp: アプリケーションをデバッグするには、 `jbang --debug quarkusapp.java` を使用し、IDE を使ってポート 4004 に接続できます。 また、従来の Quarkus のデバッグポートを使用したい場合は、 `jbang --debug=5005 quarkusapp.java` を使用できます。

source: To define a Panache entity, simply extend `PanacheEntity`, annotate it with `@Entity` and add your columns as public fields:
ja_jp: Panache エンティティーを定義するには、 `PanacheEntity` を拡張して `@Entity` とアノテーションを付け、列をパブリック フィールドとして追加します。

source: To define a Panache entity, simply extend `PanacheMongoEntity` and add your columns as public fields. You can add the `@MongoEntity` annotation to your entity if you need to customize the name of the collection, the database, or the client.
ja_jp: Panacheのエンティティを定義するには、 `PanacheMongoEntity` を拡張して、カラムをパブリックフィールドとして追加するだけです。コレクション、データベース、またはクライアントの名前をカスタマイズする必要がある場合は、 `@MongoEntity` アノテーションをエンティティに追加することができます。

source: To define a RabbitMQ binding you provide the binding's name after the `quarkus.rabbitmq.devservices.bindings` key, followed by one (or more) of the binding's properties:
ja_jp: RabbitMQのバインディングを定義するには、 `quarkus.rabbitmq.devservices.bindings` キーの後にバインディングの名前を指定し、その後にバインディングのプロパティを1つ（または複数）指定します。

source: To define a RabbitMQ exchange you provide the exchange's name after the `quarkus.rabbitmq.devservices.exchanges` key, followed by one (or more) of the exchange's properties:
ja_jp: RabbitMQエクスチェンジを定義するには、 `quarkus.rabbitmq.devservices.exchanges` キーの後にエクスチェンジの名前を指定し、続いてエクスチェンジのプロパティを1つ（または複数）指定します。

source: To define a RabbitMQ queue you provide the queue's name after the `quarkus.rabbitmq.devservices.queues` key, followed by one (or more) of the queue's properties:
ja_jp: RabbitMQキューを定義するには、 `quarkus.rabbitmq.devservices.queues` キーの後にキューの名前を指定し、その後にキューのプロパティを1つ（または複数）指定します。

source: To define a datasource, start with the following (note that this is only required if you have more than one database type installed):
ja_jp: データソースを定義するには、まず以下のようにします（複数のデータベースタイプがインストールされている場合にのみ必要となりますのでご注意ください）。

source: To define your own metrics from scratch, you have two basic options: Use the generic `MetricFactory` builders, or follow the binder pattern, and create instrumentation specific to the enabled metrics extension.
ja_jp: 独自のメトリクスを最初から定義するには、2 つの基本的なオプションがあります。汎用 `MetricFactory` ビルダーを使用するか、バインダーパターンに従い、有効なメトリクスエクステンション固有のインストルメンテーションを作成します。

source: To delete an Author by identifier, retrieve the session's indexing plan and call `purge`, passing the author class and identifier in argument.
ja_jp: 識別子で Author を削除するには、セッションのインデックスプランを取得し、 author クラスと識別子を引数に渡して `purge` を呼び出します。

source: To demonstrate different authorization policies, the steps in this tutorial guide you through building an application that provides the following endpoints:
ja_jp: このチュートリアルでは、さまざまな認可ポリシーを示すために、次のエンドポイントを提供するアプリケーションを構築する手順を説明します:

source: To deploy a JVM application:
ja_jp: JVMアプリケーションをデプロイするには

source: To deploy a native application:
ja_jp: ネイティブアプリケーションをデプロイするには

source: To deploy a native executable, you must build it with GraalVM.
ja_jp: ネイティブ実行可能ファイルをデプロイするには、GraalVM を使用してビルドする必要があります。

source: To deploy an updated version of the project, push changes to the Git repository, and then run:
ja_jp: プロジェクトの更新版をデプロイするには、変更をGitリポジトリにプッシュしてから実行します：

source: To deploy multiple instances of your verticle, use the `@Dependent` scope instead of `@ApplicationScoped`:
ja_jp: Verticleの複数のインスタンスをデプロイするには、 `@ApplicationScoped` の代わりに `@Dependent` スコープを使用します。

source: To deploy to AWS Lambda:
ja_jp: AWS Lambda へのデプロイ

source: To deploy verticles, use the `deployVerticle` method:
ja_jp: verticleをデプロイするには、 `deployVerticle` メソッドを使用します。

source: To deploy your Quarkus Native container image to this service, follow this tutorial:
ja_jp: Quarkus Nativeコンテナーイメージをこのサービスにデプロイするには、このチュートリアルに従います。

source: To deploy your application, after you built your project, execute:
ja_jp: アプリケーションをデプロイするには、プロジェクトをビルドした後、次のコマンドを実行します:

source: To detect less severe issues, adjust the value of `failBuildOnCVSS` to suppress the false positives, as demonstrated in the following code sample:
ja_jp: 比較的深刻でない問題を検出するには、次のコードサンプルで示すように、 `failBuildOnCVSS` の値を調整して誤検出を抑制してください：

source: To detect whether the current service is overloaded, an adaptation of TCP Vegas is used.
ja_jp: 現在のサービスが過負荷かどうかを検出するために、TCP Vegas を応用しています。

source: To determine whether a request should be rejected, 2 attributes are considered:
ja_jp: リクエストを拒否するかどうかを判断するには、2 つの属性が考慮されます。

source: To develop a xref:security-oidc-code-flow-authentication.adoc[Quarkus OIDC web application], set `quarkus.oidc.application-type=web-app` in the `application.properties` file before starting the application.
ja_jp: xref:security-oidc-code-flow-authentication.adoc[Quarkus OIDCウェブアプリケーション] を開発するには、アプリケーションを開始する前に、 `application.properties` ファイルで `quarkus.oidc.application-type=web-app` を設定します。

source: To disable SSL hostname verification:
ja_jp: SSL ホスト名検証を無効にするには、次のように指定します。

source: To disable all SSL verifications, add the following property to your configuration:
ja_jp: 全てのSSL検証を無効にするには、次のプロパティーを設定に追加します。

source: To disable health reporting, set the `health-enabled` attribute for the channel to false.
ja_jp: ヘルスレポートを無効にするには、チャネルの `health-enabled` 属性を false に設定します。

source: To disable health reporting, set the `health-enabled` attribute for the channel to false. On the inbound side (receiving messages from AMQP), the check verifies that the receiver is attached to the broker. On the outbound side (sending records to AMQP), the check verifies that the sender is attached to the broker.
ja_jp: ヘルスレポートを無効にするには、チャネルの `health-enabled` 属性を false に設定します。インバウンド側 (AMQP からのメッセージの受信) では、チェックは受信者がブローカーに接続されていることを確認します。アウトバウンド側 (AMQP へのレコードの送信) では、チェックにより、送信者がブローカーに接続されていることが確認されます。

source: To disable hostname verification:
ja_jp: ホスト名の検証を無効にするには、次のように指定します。

source: To disable it:
ja_jp: 無効にするには、次のように指定します。

source: To disable lazy loading and instead pre-load all resources at startup, configure the following property:
ja_jp: 遅延ロードを無効にし、代わりに起動時にすべてのリソースを事前ロードするには、次のプロパティーを設定します。

source: To disable metrics for a particular data source, set `quarkus.datasource.jdbc.enable-metrics` to `false`, or apply `quarkus.datasource.<datasource name>.jdbc.enable-metrics` for a named datasource. This disables collecting the metrics and exposing them in the `/q/metrics` endpoint if the mechanism to collect them is disabled.
ja_jp: 特定のデータ・ソースのメトリクスを無効にするには、 `quarkus.datasource.jdbc.enable-metrics` を `false` に設定するか、指定したデータ・ソースに対して `quarkus.datasource.<datasource name>.jdbc.enable-metrics` を適用します。 これにより、メトリクスを収集するメカニズムが無効になっている場合は、メトリクスの収集と `/q/metrics` エンドポイントでの公開が無効になります。

source: To disable metrics for a particular datasource, set `quarkus.datasource.jdbc.enable-metrics` to `false`, or apply `quarkus.datasource.<datasource name>.jdbc.enable-metrics` for a named datasource. This disables collecting the metrics and exposing them in the `/q/metrics` endpoint if the mechanism to collect them is disabled.
ja_jp: 特定のデータソースのメトリクスを無効にするには、 `quarkus.datasource.jdbc.enable-metrics` を `false` に設定するか、名前付きデータソースに対して `quarkus.datasource.<datasource name>.jdbc.enable-metrics` を適用します。 これにより、メトリクスを収集するメカニズムが無効になっている場合は、メトリクスを収集して `/q/metrics` エンドポイントで公開することが無効になります。

source: To disable metrics for a specific datasource, set `quarkus.datasource.jdbc.metrics.enabled=false`. For a named datasource, set `quarkus.datasource.<datasource name>.jdbc.metrics.enabled=false`. This setting stops internal metrics collection and stops exposing datasource metrics at the `/q/metrics` endpoint.
ja_jp: 特定のデータソースのメトリクスを無効にするには、 `quarkus.datasource.jdbc.metrics.enabled=false` を設定します。 名前付きデータソースの場合は、 `quarkus.datasource.<datasource name>.jdbc.metrics.enabled=false` を設定します。 この設定により、内部メトリクス収集が停止し、 `/q/metrics` エンドポイントでのデータソースメトリクスの公開が停止します。

source: To disable on-demand fetching and instead pre-load resources at startup, configure the following property:
ja_jp: オンデマンドによる取得を無効にし、代わりに起動時にリソースを事前ロードするには、以下のプロパティーを設定します。

source: To disable particular parts of OpenTelemetry, you can set the properties listed in this xref:opentelemetry.adoc#disable-all-or-parts-of-the-opentelemetry-extension[section of the OpenTelemetry guide].
ja_jp: OpenTelemetry の特定の部分を無効にするには、この xref:opentelemetry.adoc#disable-all-or-parts-of-the-opentelemetry-extension[OpenTelemetry ガイドのセクション] にリストされているプロパティーを設定できます。

source: To disable proactive authentication in Quarkus, set the following attribute in the `application.properties` configuration file:
ja_jp: Quarkusでプロアクティブ認証を無効にするには、 `application.properties` 設定ファイルで次の属性を設定します:

source: To disable the JDBC datasource explicitly:
ja_jp: JDBC データソースを明示的に無効にするには、次のようにします:

source: To disable the Redis client metrics when `quarkus-micrometer` is used, add the following property to the application configuration:
ja_jp: `quarkus-micrometer` が使用されている時にRedisクライアントメトリクスを無効にするには、アプリケーション設定に次のプロパティを追加します:

source: To disable the SSL hostname verification for a specific REST client, add the following property to your configuration:
ja_jp: 特定のRESTクライアントのSSLホスト名検証を無効にするには、次のプロパティーを構成に追加します。

source: To disable the Stork metrics when `quarkus-micrometer` is used, add the following property to the application configuration:
ja_jp: `quarkus-micrometer` が使用されているときに Stork メトリクスを無効にするには、アプリケーション設定に以下のプロパティを追加します：
